{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "58jkduv6EDXs"
      },
      "source": [
        "**ФИО:** Смольков Максим Дмитриевич\n",
        "\n",
        "**Группа:** 25152"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "qO-jk6piFLOj"
      },
      "source": [
        "# **Алгоритм Витерби:**:"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "uw3jxDS-FLyB"
      },
      "source": [
        "Входные данные:\n",
        "\n",
        "Вероятности перехода между состояниями N (NonCpG) и C (CpG):\n",
        "```\n",
        "trans_prob = [[0.90, 0.01],  # N>N, N>C\n",
        "              [0.01, 0.90]]  # C>N, C>C\n",
        "```\n",
        "\n",
        "Эмиссионные вероятности:\n",
        "```\n",
        "emit_prob = [\n",
        "    {'A': 0.4, 'C': 0.1, 'G': 0.1, 'T': 0.4},  # для N\n",
        "    {'A': 0.1, 'C': 0.4, 'G': 0.4, 'T': 0.1}]  # для C\n",
        "```\n",
        "\n",
        "Последовательность нуклеотидов:\n",
        "```\n",
        "seq = 'ATTTAATCGCGCGCGATTACGTACTAGCTAATTAACGGGCGGCGCGCATTATAA'\n",
        "```\n",
        "Необходимо реализовать функцию, которая с помощью алгоритма Витерби определяет наиболее вероятную последовательность состояний для заданной последовательности нуклеотидов и выводит строку этих состояний.\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 2,
      "metadata": {
        "id": "XU4VeM6HEB4d"
      },
      "outputs": [],
      "source": [
        "def viterbi_algorithm(seq, trans_prob, emit_prob):\n",
        "    \"\"\"\n",
        "    Алгоритм Витерби для поиска наиболее вероятной последовательности скрытых состояний.\n",
        "    \n",
        "    Параметры:\n",
        "    seq - строка с последовательностью нуклеотидов\n",
        "    trans_prob - матрица вероятностей переходов между состояниями\n",
        "    emit_prob - список словарей эмиссионных вероятностей для каждого состояния\n",
        "    \"\"\"\n",
        "    \n",
        "    # Состояния: N (индекс 0) и C (индекс 1)\n",
        "    states = ['N', 'C']\n",
        "    num_states = len(states)\n",
        "    \n",
        "    # Инициализация таблиц\n",
        "    n = len(seq)\n",
        "    V = [[0.0 for _ in range(num_states)] for _ in range(n)]  # Таблица вероятностей\n",
        "    path = [[0 for _ in range(num_states)] for _ in range(n)]  # Таблица путей\n",
        "    \n",
        "    # Шаг 1: Инициализация (первый символ)\n",
        "    for i in range(num_states):\n",
        "        first_nucleotide = seq[0]\n",
        "        # Равномерное начальное распределение (0.5 для каждого состояния)\n",
        "        V[0][i] = 0.5 * emit_prob[i].get(first_nucleotide, 0.0)\n",
        "        path[0][i] = 0  # Начальное состояние\n",
        "    \n",
        "    # Шаг 2: Рекурсия\n",
        "    for t in range(1, n):\n",
        "        nucleotide = seq[t]\n",
        "        for j in range(num_states):\n",
        "            # Находим максимальную вероятность перехода из предыдущих состояний\n",
        "            max_prob = 0.0\n",
        "            max_state = 0\n",
        "            \n",
        "            for i in range(num_states):\n",
        "                prob = V[t-1][i] * trans_prob[i][j] * emit_prob[j].get(nucleotide, 0.0)\n",
        "                if prob > max_prob:\n",
        "                    max_prob = prob\n",
        "                    max_state = i\n",
        "            \n",
        "            V[t][j] = max_prob\n",
        "            path[t][j] = max_state\n",
        "    \n",
        "    # Шаг 3: Завершение (нахождение конечного состояния с максимальной вероятностью)\n",
        "    max_final_prob = 0.0\n",
        "    last_state = 0\n",
        "    \n",
        "    for i in range(num_states):\n",
        "        if V[n-1][i] > max_final_prob:\n",
        "            max_final_prob = V[n-1][i]\n",
        "            last_state = i\n",
        "    \n",
        "    # Шаг 4: Восстановление пути (обратный проход)\n",
        "    best_path = [0] * n\n",
        "    best_path[n-1] = last_state\n",
        "    \n",
        "    for t in range(n-2, -1, -1):\n",
        "        best_path[t] = path[t+1][best_path[t+1]]\n",
        "    \n",
        "    # Преобразование индексов состояний в символы\n",
        "    result = ''.join(states[state] for state in best_path)\n",
        "    \n",
        "    return result, max_final_prob"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 4,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Последовательность нуклеотидов:\n",
            "ATTTAATCGCGCGCGATTACGTACTAGCTAATTAACGGGCGGCGCGCATTATAA\n",
            "\n",
            "Наиболее вероятная последовательность состояний (N/C):\n",
            "NNNNNNNCCCCCCCCNNNNNNNNNNNNNNNNNNNNCCCCCCCCCCCCNNNNNNN\n",
            "\n",
            "Вероятность этой последовательности: 9.0738697708e-32\n",
            "\n",
            "Статистика:\n",
            "Количество N-состояний: 34\n",
            "Количество C-состояний: 20\n",
            "Доля CpG-островков (C): 37.0%\n"
          ]
        }
      ],
      "source": [
        "# Входные данные из задания\n",
        "trans_prob = [\n",
        "    [0.90, 0.10],  # N->N, N->C\n",
        "    [0.10, 0.90]   # C->N, C->C\n",
        "]\n",
        "\n",
        "emit_prob = [\n",
        "    {'A': 0.4, 'C': 0.1, 'G': 0.1, 'T': 0.4},  # для N\n",
        "    {'A': 0.1, 'C': 0.4, 'G': 0.4, 'T': 0.1}   # для C\n",
        "]\n",
        "\n",
        "seq = \"ATTTAATCGCGCGCGATTACGTACTAGCTAATTAACGGGCGGCGCGCATTATAA\"\n",
        "\n",
        "# Запуск алгоритма\n",
        "result_sequence, probability = viterbi_algorithm(seq, trans_prob, emit_prob)\n",
        "\n",
        "print(\"Последовательность нуклеотидов:\")\n",
        "print(seq)\n",
        "print(\"\\nНаиболее вероятная последовательность состояний (N/C):\")\n",
        "print(result_sequence)\n",
        "print(f\"\\nВероятность этой последовательности: {probability:.10e}\")\n",
        "\n",
        "# Дополнительная информация о результатах\n",
        "print(\"\\nСтатистика:\")\n",
        "print(f\"Количество N-состояний: {result_sequence.count('N')}\")\n",
        "print(f\"Количество C-состояний: {result_sequence.count('C')}\")\n",
        "print(f\"Доля CpG-островков (C): {result_sequence.count('C')/len(result_sequence)*100:.1f}%\")"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.14.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
